%GD_zoom;
C=[1000.654013015184, 600.970026064292, 401.013927576602, 600.970026064292, 1000.986291614741; ...
   500.977404193782, 1000.981320590790, 1501.008077994429, 2000.981320590791, 2500.667438134236];
RealValue=[1000,600,400,600,1000;500,1000,1500,2000,2500];
N=5;
%zoom begins;
t=(N-1)/2;
zoom_x=zeros(t,1);
zoom_y=zeros(2,1);
for i=1:t
    zoom_x(i)=(C(2,N-i+1)-C(2,i))/(RealValue(2,N-i+1)-RealValue(2,i));
end
Xzoom=1/mean(zoom_x);
zoom_y(1)=(C(1,1)-C(1,t+1))/(RealValue(1,1)-RealValue(1,t+1));
zoom_y(2)=(C(1,N)-C(1,t+1))/(RealValue(1,N)-RealValue(1,t+1));
Yzoom=1/mean(zoom_y);

C(1,:)=C(1,:)*Yzoom
C(2,:)=C(2,:)*Xzoom

%对图像进行大小修正后，之后对其位置的判断会不会受到影响？？？？？
%感觉上，会；

